20150526T000000==coa=div1--pham-v-corbett-187-wn-app-816-351-p3d-214-2015__breach_case_habitability_warranty.org
#+title:      Pham v. Corbett, 187 Wn. App. 816, 351 P.3d 214 (2015)
#+date:       [2015-05-26 Tue 00:00]
#+filetags:   :breach:case:habitability:warranty:
#+identifier: 20150526T000000

* Pham v. Corbett -- Court of Appeals of Washington, Division 1. | May 26, 2015 | 187 Wash.App. 816 | 351 P.3d 214

- Washington Citation :: Pham v. Corbett, 187 Wn. App. 816, 351 P.3d 214 (2015)

- All Citations :: 187 Wash.App. 816, 351 P.3d 214


                          187 Wash.App. 816
             Court of Appeals of Washington, Division 1.
                        Lang PHAM, Appellant,
                                  v.
             Shawn CORBETT and Shakia Morgan, Respondent.

                            No. 70956–9–I
                            May 26, 2015.

** Brief

** Synopsis

Background: Landlord brought unlawful detainer action against tenants. Tenants counterclaimed for relocation assistance and raised defenses of setoff and breach of implied warranty of habitability. Following a bench trial, the Superior Court, King County, Judith H. Ramseyer, J., found that landlord had breached implied warranty and awarded damages and relocation assistance to tenants. Landlord appealed.

Holdings: The Court of Appeals, Spearman, C.J., held that:

[1] evidence was sufficient to establish that landlord breached implied warranty of habitability;

[2] tenants provided landlord with notice and opportunity to cure defects in rental unit;

[3] tenants were entitled to relocation assistance;

[4] tenants were entitled to offset pre-paid rent against unpaid rent;

[5] evidence supported finding that rental unit’s habitability had been reduced by 25%;

[6] landlord was not entitled to charge tenants late fees for holdover tenancy.

Affirmed.

Procedural Posture(s): On Appeal.

** West Headnotes (34)

*** [1] Appeal and Error  [[1: 30-k-3459][30-k-3459]]  Substantial Evidence
Appeal and ErrorJudge as factfinder below
Appeal and ErrorJudgment in General

- /30 Appeal and Error/
- /30-XVI Review/
- /30-XVI(D) Scope and Extent of Review/
- /30-XV I(D)10Sufficiency of Evidence/
- *30-k-3459 Substantial Evidence*
- *30-k-3460 In general*
- /(Formerly 30k846(6))/
- /30 Appeal and Error/
- /30-XVI Review/
- /30-XVI(D) Scope and Extent of Review/
- /30-XV I(D)10Sufficiency of Evidence/
- *30-k-3459 Substantial Evidence*
- *30-k-3462 Judge as factfinder below*
- /(Formerly 30k1010.1(6))/
- /30 Appeal and Error/
- /30-XVI Review/
- /30-XVI(D) Scope and Extent of Review/
- /30-XV I(D)12Judgment in General/
- *30-k-3541 In general*
- /(Formerly 30k846(6))/

When a trial court has weighed the evidence in a bench trial, appellate review is limited to determining whether substantial evidence supports its findings of fact and, if so, whether the findings support the trial court’s conclusions of law.

- 11 Cases that cite this headnote

*** [2] Appeal and Error  [[2: 30-k-3463][30-k-3463]]  What constitutes substantial evidence

- /30 Appeal and Error/
- /30-XVI Review/
- /30-XVI(D) Scope and Extent of Review/
- /30-XV I(D)10Sufficiency of Evidence/
- *30-k-3459 Substantial Evidence*
- *30-k-3463 What constitutes substantial evidence*
- /(Formerly 30k1010.1(6))/

Substantial evidence exists to support a trial court’s finding of fact when there is a sufficient quantity of evidence to persuade a fairminded, rational person that a finding is true.

- 8 Cases that cite this headnote

*** [3] Appeal and Error  [[3: 30-k-3935][30-k-3935]]  Verdict, Findings, and Sufficiency of Evidence

- /30 Appeal and Error/
- /30-XVI Review/
- /30-XVI(F) Presumptions and Burdens on Review/
- /30-XVI(F)2 Particular Matters and Rulings/
- *30-k-3935 Verdict, Findings, and Sufficiency of Evidence*
- *30-k-3936 In general*
- /(Formerly 30k931(1), 30k901)/

A reviewing court begins with a presumption in favor of the trial court’s factual findings and the appellant has the burden of showing that a finding of fact is not supported by substantial evidence.

- 2 Cases that cite this headnote

*** [4] Appeal and Error  [[4: 30-k-3402][30-k-3402]]  Conclusiveness and effect of verdict or findings in general

- /30 Appeal and Error/
- /30-XVI Review/
- /30-XVI(D) Scope and Extent of Review/
- /30-XVI(D)9 Verdict and Findings in General/
- *30-k-3402 Conclusiveness and effect of verdict or findings in general*
- /(Formerly 30k1008.1(1))/

Unchallenged findings are verities on appeal.

- 11 Cases that cite this headnote

