osb/html/20150526T000000==coa=div1--pham-v-corbett-187-wn-app-816-351-p3d-214-2015__breach_case_habitability_warranty.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://hjp.org/rss.xml"
      title="RSS feed for https://hjp.org">
<title>Pham v. Corbett, 187 Wn. App. 816, 351 P.3d 214 (2015)</title>
</head>
<body>
<div id="preamble" class="status"></div>
<div id="content">
<div class="post-date">26 May 2015</div><h1 class="post-title"><a href="https://hjp.org/20150526T000000==coa=div1--pham-v-corbett-187-wn-app-816-351-p3d-214-2015__breach_case_habitability_warranty.html">Pham v. Corbett, 187 Wn. App. 816, 351 P.3d 214 (2015)</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3907035">Pham v. Corbett &#x2013; Court of Appeals of Washington, Division 1. | May 26, 2015 | 187 Wash.App. 816 | 351 P.3d 214</a>
<ul>
<li><a href="#org36c7b76">Brief</a></li>
<li><a href="#org4466a57">Synopsis</a></li>
<li><a href="#org4b7003e">West Headnotes (34)</a>
<ul>
<li><a href="#org9244ac0">[1] Appeal and Error  30-k-3459  Substantial Evidence</a></li>
<li><a href="#org563ba4a">[2] Appeal and Error  30-k-3463  What constitutes substantial evidence</a></li>
<li><a href="#org9137f54">[3] Appeal and Error  30-k-3935  Verdict, Findings, and Sufficiency of Evidence</a></li>
<li><a href="#orgd1515c8">[4] Appeal and Error  30-k-3402  Conclusiveness and effect of verdict or findings in general</a></li>
<li><a href="#orgeb6e2c9">[5] Appeal and Error  30-k-3166  De novo review</a></li>
<li><a href="#org07fd23e">[6] Landlord and Tenant  233-k-1787  Defenses and grounds of opposition in general</a></li>
<li><a href="#org15b24de">[7] Landlord and Tenant  233-k-1789  Set-off and counterclaim</a></li>
<li><a href="#org44eb104">[8] Landlord and Tenant  233-k-1789  Set-off and counterclaim</a></li>
<li><a href="#org9ba3aca">[9] Landlord and Tenant  233-k-1781  Nature and form</a></li>
<li><a href="#org7a16c97">[10] Forcible Entry and Detainer  179-k-6(2)  Trial of title and right of possession</a></li>
<li><a href="#org4e808e5">[11] Forcible Entry and Detainer  179-k-32  Scope of inquiry and powers of court</a></li>
<li><a href="#org5001f8f">[12] Action  13-k-36  Change of character or form</a></li>
<li><a href="#orga1575bb">[13] Action  13-k-36  Change of character or form</a></li>
<li><a href="#orgaea7de1">[14] Action  13-k-36  Change of character or form</a></li>
<li><a href="#org4731d46">[15] Landlord and Tenant  233-k-1789  Set-off and counterclaim</a></li>
<li><a href="#orgcc144ba">[16] Landlord and Tenant  233-k-1054(3)  Evidence</a></li>
<li><a href="#orgc4973a7">[17] Landlord and Tenant  233-k-1787  Defenses and grounds of opposition in general</a></li>
<li><a href="#orgc4bc735">[18] Landlord and Tenant  233-k-1439  Condition of Premises</a></li>
<li><a href="#org9de9a51">[19] Landlord and Tenant  233-k-1054(4)  Trial</a></li>
<li><a href="#org120ca70">[20] Landlord and Tenant  233-k-1052  Warranty of habitability</a></li>
<li><a href="#orgcc8e304">[21] Appeal and Error  30-k-3415  Substitution of Reviewing Court’s Discretion or Judgment</a></li>
<li><a href="#org177876c">[22] Landlord and Tenant  233-k-1054  Actions</a></li>
<li><a href="#orgfc47bbd">[23] Motions  267-k-62  Construction and operation of orders in general</a></li>
<li><a href="#orgfb6b8e3">[24] Health  198H-k-392  Buildings, structures, and building components</a></li>
<li><a href="#org1e392d5">[25] Health  198H-k-392  Buildings, structures, and building components</a></li>
<li><a href="#orgd36396f">[26] Health  198H-k-392  Buildings, structures, and building components</a></li>
<li><a href="#orgfb6069a">[27] Health  198H-k-392  Buildings, structures, and building components</a></li>
<li><a href="#org732230a">[28] Health  198H-k-392  Buildings, structures, and building components</a></li>
<li><a href="#org526e05a">[29] Landlord and Tenant  233-k-1051  Statutory regulations in general</a></li>
<li><a href="#org93f6917">[30] Landlord and Tenant  233-k-1540  Claims which may be subject of set-off, counterclaim, or recoupment in general</a></li>
<li><a href="#org21792e0">[31] Landlord and Tenant  233-k-1806  Damages and amount of recovery</a></li>
<li><a href="#orge68de75">[32] Landlord and Tenant  233-k-1597  Damages</a></li>
<li><a href="#org30c0e29">[33] Landlord and Tenant  233-k-851  Conditions in general</a></li>
<li><a href="#orgc999d9c">[34] Appeal and Error  30-k-4072  Verdict, Findings, Sufficiency of Evidence, and Judgment</a></li>
</ul>
</li>
<li><a href="#org8df5fa0">Attorneys and Law Firms</a></li>
<li><a href="#orge2bfbbe">Opinion</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org3907035" class="outline-2">
<h2 id="org3907035">Pham v. Corbett &#x2013; Court of Appeals of Washington, Division 1. | May 26, 2015 | 187 Wash.App. 816 | 351 P.3d 214</h2>
<div class="outline-text-2" id="text-org3907035">
<dl class="org-dl">
<dt>Washington Citation</dt><dd>Pham v. Corbett, 187 Wn. App. 816, 351 P.3d 214 (2015)</dd>

<dt>All Citations</dt><dd>187 Wash.App. 816, 351 P.3d 214</dd>
</dl>


<p>
             187 Wash.App. 816
Court of Appeals of Washington, Division 1.
           Lang PHAM, Appellant,
                     v.
Shawn CORBETT and Shakia Morgan, Respondent.
</p>

<p>
No. 70956–9–I
May 26, 2015.
</p>
</div>

<div id="outline-container-org36c7b76" class="outline-3">
<h3 id="org36c7b76">Brief</h3>
</div>

<div id="outline-container-org4466a57" class="outline-3">
<h3 id="org4466a57">Synopsis</h3>
<div class="outline-text-3" id="text-org4466a57">
<p>
Background: Landlord brought unlawful detainer action against tenants. Tenants counterclaimed for relocation assistance and raised defenses of setoff and breach of implied warranty of habitability. Following a bench trial, the Superior Court, King County, Judith H. Ramseyer, J., found that landlord had breached implied warranty and awarded damages and relocation assistance to tenants. Landlord appealed.
</p>

<p>
Holdings: The Court of Appeals, Spearman, C.J., held that:
</p>

<p>
[1] evidence was sufficient to establish that landlord breached implied warranty of habitability;
</p>

<p>
[2] tenants provided landlord with notice and opportunity to cure defects in rental unit;
</p>

<p>
[3] tenants were entitled to relocation assistance;
</p>

<p>
[4] tenants were entitled to offset pre-paid rent against unpaid rent;
</p>

<p>
[5] evidence supported finding that rental unit’s habitability had been reduced by 25%;
</p>

<p>
[6] landlord was not entitled to charge tenants late fees for holdover tenancy.
</p>

<p>
Affirmed.
</p>

<p>
Procedural Posture(s): On Appeal.
</p>
</div>
</div>

<div id="outline-container-org4b7003e" class="outline-3">
<h3 id="org4b7003e">West Headnotes (34)</h3>
<div class="outline-text-3" id="text-org4b7003e">
</div>
<div id="outline-container-org9244ac0" class="outline-4">
<h4 id="org9244ac0">[1] Appeal and Error  <a href="#org17f761e">30-k-3459</a>  Substantial Evidence</h4>
<div class="outline-text-4" id="text-org9244ac0">
<p>
Appeal and ErrorJudge as factfinder below
Appeal and ErrorJudgment in General
</p>

<ul class="org-ul">
<li><i>30 Appeal and Error</i></li>
<li><i>30-XVI Review</i></li>
<li><i>30-XVI(D) Scope and Extent of Review</i></li>
<li><i>30-XV I(D)10Sufficiency of Evidence</i></li>
<li><b>30-k-3459 Substantial Evidence</b></li>
<li><b>30-k-3460 In general</b></li>
<li><i>(Formerly 30k846(6))</i></li>
<li><i>30 Appeal and Error</i></li>
<li><i>30-XVI Review</i></li>
<li><i>30-XVI(D) Scope and Extent of Review</i></li>
<li><i>30-XV I(D)10Sufficiency of Evidence</i></li>
<li><b>30-k-3459 Substantial Evidence</b></li>
<li><b>30-k-3462 Judge as factfinder below</b></li>
<li><i>(Formerly 30k1010.1(6))</i></li>
<li><i>30 Appeal and Error</i></li>
<li><i>30-XVI Review</i></li>
<li><i>30-XVI(D) Scope and Extent of Review</i></li>
<li><i>30-XV I(D)12Judgment in General</i></li>
<li><b>30-k-3541 In general</b></li>
<li><i>(Formerly 30k846(6))</i></li>
</ul>

<p>
When a trial court has weighed the evidence in a bench trial, appellate review is limited to determining whether substantial evidence supports its findings of fact and, if so, whether the findings support the trial court’s conclusions of law.
</p>

<ul class="org-ul">
<li>11 Cases that cite this headnote</li>
</ul>
</div>
</div>

<div id="outline-container-org563ba4a" class="outline-4">
<h4 id="org563ba4a">[2] Appeal and Error  <a href="#orgd51826c">30-k-3463</a>  What constitutes substantial evidence</h4>
<div class="outline-text-4" id="text-org563ba4a">
<ul class="org-ul">
<li><i>30 Appeal and Error</i></li>
<li><i>30-XVI Review</i></li>
<li><i>30-XVI(D) Scope and Extent of Review</i></li>
<li><i>30-XV I(D)10Sufficiency of Evidence</i></li>
<li><b>30-k-3459 Substantial Evidence</b></li>
<li><b>30-k-3463 What constitutes substantial evidence</b></li>
<li><i>(Formerly 30k1010.1(6))</i></li>
</ul>

<p>
Substantial evidence exists to support a trial court’s finding of fact when there is a sufficient quantity of evidence to persuade a fairminded, rational person that a finding is true.
</p>

<ul class="org-ul">
<li>8 Cases that cite this headnote</li>
</ul>
</div>
</div>

<div id="outline-container-org9137f54" class="outline-4">
<h4 id="org9137f54">[3] Appeal and Error  <a href="#org3298e54">30-k-3935</a>  Verdict, Findings, and Sufficiency of Evidence</h4>
<div class="outline-text-4" id="text-org9137f54">
<ul class="org-ul">
<li><i>30 Appeal and Error</i></li>
<li><i>30-XVI Review</i></li>
<li><i>30-XVI(F) Presumptions and Burdens on Review</i></li>
<li><i>30-XVI(F)2 Particular Matters and Rulings</i></li>
<li><b>30-k-3935 Verdict, Findings, and Sufficiency of Evidence</b></li>
<li><b>30-k-3936 In general</b></li>
<li><i>(Formerly 30k931(1), 30k901)</i></li>
</ul>

<p>
A reviewing court begins with a presumption in favor of the trial court’s factual findings and the appellant has the burden of showing that a finding of fact is not supported by substantial evidence.
</p>

<ul class="org-ul">
<li>2 Cases that cite this headnote</li>
</ul>
</div>
</div>

<div id="outline-container-orgd1515c8" class="outline-4">
<h4 id="orgd1515c8">[4] Appeal and Error  <a href="#orge58ddb5">30-k-3402</a>  Conclusiveness and effect of verdict or findings in general</h4>
<div class="outline-text-4" id="text-orgd1515c8">
<ul class="org-ul">
<li><i>30 Appeal and Error</i></li>
<li><i>30-XVI Review</i></li>
<li><i>30-XVI(D) Scope and Extent of Review</i></li>
<li><i>30-XVI(D)9 Verdict and Findings in General</i></li>
<li><b>30-k-3402 Conclusiveness and effect of verdict or findings in general</b></li>
<li><i>(Formerly 30k1008.1(1))</i></li>
</ul>

<p>
Unchallenged findings are verities on appeal.
</p>

<ul class="org-ul">
<li>11 Cases that cite this headnote</li>
</ul>
</div>
</div>
