20150526T000000==coa=div1--pham-v-corbett-187-wn-app-816-351-p3d-214-2015__breach_case_habitability_warranty.org
*** [5] Appeal and Error  [[5: 30-k-3166][30-k-3166]]  De novo review

- /30 Appeal and Error/
- /30-XVI Review/
- /30-XVI(D) Scope and Extent of Review/
- /30-XVI(D)2 Particular Subjects of Review in General/
- *30-k-3162 Conclusions of Law in General*
- *30-k-3166 De novo review*
- /(Formerly 30k893(1))/

Conclusions of law are reviewed de novo.

- 3 Cases that cite this headnote

*** [6] Landlord and Tenant  [[6: 233-k-1787][233-k-1787]]  Defenses and grounds of opposition in general

- /233 Landlord and Tenant/
- /233-VIII Reentry and Recovery of Possession by Landlord/
- /233-VIII(D) Actions for Unlawful Detainer/
- *233-k-1783 Right of Action and Defenses*
- *233-k-1787 Defenses and grounds of opposition in general*

Tenants were entitled to raise defense of breach of implied warranty of habitability in landlord’s unlawful detainer action, as it was equitable defense that directly related to issue of possession. West’s RCWA 59.18.400.

*** [7] Landlord and Tenant  [[7: 233-k-1789][233-k-1789]]  Set-off and counterclaim

- /233 Landlord and Tenant/
- /233-VIII Reentry and Recovery of Possession by Landlord/
- /233-VIII(D) Actions for Unlawful Detainer/
- *233-k-1783 Right of Action and Defenses*
- *233-k-1789 Set-off and counterclaim*

Counterclaims are not allowed in unlawful detainer actions, except for those based on facts that would excuse a tenant’s breach, such as when resolution of the counterclaim is necessary to determine the right of possession.

*** [8] Landlord and Tenant  [[8: 233-k-1789][233-k-1789]]  Set-off and counterclaim

- /233 Landlord and Tenant/
- /233-VIII Reentry and Recovery of Possession by Landlord/
- /233-VIII(D) Actions for Unlawful Detainer/
- *233-k-1783 Right of Action and Defenses*
- *233-k-1789 Set-off and counterclaim*

Tenants were entitled to raise counterclaim for relocation assistance in landlord’s unlawful detainer action; issue of right to possession was intimately tied to lawful status of the unit and tenants’ right to relocation assistance, relocation assistance claim was based on facts that would excuse tenants’ breach because it required finding that the dwelling was or would be unlawful to occupy, and excluding relocation assistance claim from unlawful detainer proceedings would undermine the goals of the relocation assistance statute. West’s RCWA 59.18.085.

- 2 Cases that cite this headnote

*** [9] Landlord and Tenant  [[9: 233-k-1781][233-k-1781]]  Nature and form

- /233 Landlord and Tenant/
- /233-VIII Reentry and Recovery of Possession by Landlord/
- /233-VIII(D) Actions for Unlawful Detainer/
- *233-k-1781 Nature and form*

An unlawful detainer action is a limited statutory proceeding to resolve the right to possession between the landlord and the tenant. West’s RCWA 59.12.010 et seq.

*** [10] Forcible Entry and Detainer  [[10: 179-k-6(2)][179-k-6(2)]]  Trial of title and right of possession

- /179 Forcible Entry and Detainer/
- /179-I Civil Liability/
- *179-k-6 Nature and Form of Remedy*
- *179-k-6(2) Trial of title and right of possession*

In unlawful detainer actions, the law draws a distinction between possession and the right of possession.

*** [11] Forcible Entry and Detainer  [[11: 179-k-32][179-k-32]]  Scope of inquiry and powers of court

- /179 Forcible Entry and Detainer/
- /179-I Civil Liability/
- *179-k-31 Trial*
- *179-k-32 Scope of inquiry and powers of court*

Once an unlawful detainer action is commenced and the defendant does not concede the right to possession, he or she has the right to have the issue determined.

*** [12] Action  [[12: 13-k-36][13-k-36]]  Change of character or form

- /13 Action/
- /13-II Nature and Form/
- *13-k-36 Change of character or form*

Where the right to possession ceases to be at issue at any time between the commencement of an unlawful detainer action and trial of that action, the proceeding may be converted into an ordinary civil suit for damages.

*** [13] Action  [[13: 13-k-36][13-k-36]]  Change of character or form

- /13 Action/
- /13-II Nature and Form/
- *13-k-36 Change of character or form*

A trial court has inherent power to fashion the method by which an unlawful detainer action is converted to an ordinary civil action one possession ceases to be at issue.

*** [14] Action  [[14: 13-k-36][13-k-36]]  Change of character or form

- /13 Action/
- /13-II Nature and Form/
- *13-k-36 Change of character or form*

Once possession ceases to be at issue, and an unlawful detainer case has been converted to a civil action for damages, the trial court’s general jurisdiction is restored and it can hear claims between the parties that were excluded from the unlawful detainer action.

*** [15] Landlord and Tenant  [[15: 233-k-1789][233-k-1789]]  Set-off and counterclaim

- /233 Landlord and Tenant/
- /233-VIII Reentry and Recovery of Possession by Landlord/
- /233-VIII(D) Actions for Unlawful Detainer/
- *233-k-1783 Right of Action and Defenses*
- *233-k-1789 Set-off and counterclaim*

An unlawful detainer action is an appropriate forum for relocation assistance claims. West’s RCWA 59.18.085.

*** [16] Landlord and Tenant  [[16: 233-k-1054(3)][233-k-1054(3)]]  Evidence

- /233 Landlord and Tenant/
- /233-V Enjoyment and Use of Premises/
- /233-V(B) Description, Extent, and Condition/
- *233-k-1049 Tenantable Condition of Premises*
- *233-k-1054 Actions*
- *233-k-1054(3) Evidence*

Evidence was sufficient to establish that conditions in rental unit presented substantial risk of future danger, so as to support finding that landlord breached implied warranty of habitability; evidence was presented that city housing and zoning inspector determined that there was sewage leak that needed to be rectified quickly, that landlord had been informed about sewage leak and that lines needed to be replaced, that there were rodents present, that stairs, handrails, back door, door to crawl space, and bathroom sink were in poor condition, and that there were dangerous electrical violations.

