osb/html/20150526T000000==coa=div1--pham-v-corbett-187-wn-app-816-351-p3d-214-2015__breach_case_habitability_warranty.html

<div id="outline-container-orgeb6e2c9" class="outline-4">
<h4 id="orgeb6e2c9">[5] Appeal and Error  <a href="#org404a40b">30-k-3166</a>  De novo review</h4>
<div class="outline-text-4" id="text-orgeb6e2c9">
<ul class="org-ul">
<li><i>30 Appeal and Error</i></li>
<li><i>30-XVI Review</i></li>
<li><i>30-XVI(D) Scope and Extent of Review</i></li>
<li><i>30-XVI(D)2 Particular Subjects of Review in General</i></li>
<li><b>30-k-3162 Conclusions of Law in General</b></li>
<li><b>30-k-3166 De novo review</b></li>
<li><i>(Formerly 30k893(1))</i></li>
</ul>

<p>
Conclusions of law are reviewed de novo.
</p>

<ul class="org-ul">
<li>3 Cases that cite this headnote</li>
</ul>
</div>
</div>

<div id="outline-container-org07fd23e" class="outline-4">
<h4 id="org07fd23e">[6] Landlord and Tenant  <a href="#org5e81a3f">233-k-1787</a>  Defenses and grounds of opposition in general</h4>
<div class="outline-text-4" id="text-org07fd23e">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-VIII Reentry and Recovery of Possession by Landlord</i></li>
<li><i>233-VIII(D) Actions for Unlawful Detainer</i></li>
<li><b>233-k-1783 Right of Action and Defenses</b></li>
<li><b>233-k-1787 Defenses and grounds of opposition in general</b></li>
</ul>

<p>
Tenants were entitled to raise defense of breach of implied warranty of habitability in landlord’s unlawful detainer action, as it was equitable defense that directly related to issue of possession. West’s RCWA 59.18.400.
</p>
</div>
</div>

<div id="outline-container-org15b24de" class="outline-4">
<h4 id="org15b24de">[7] Landlord and Tenant  <a href="#org3bb7eda">233-k-1789</a>  Set-off and counterclaim</h4>
<div class="outline-text-4" id="text-org15b24de">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-VIII Reentry and Recovery of Possession by Landlord</i></li>
<li><i>233-VIII(D) Actions for Unlawful Detainer</i></li>
<li><b>233-k-1783 Right of Action and Defenses</b></li>
<li><b>233-k-1789 Set-off and counterclaim</b></li>
</ul>

<p>
Counterclaims are not allowed in unlawful detainer actions, except for those based on facts that would excuse a tenant’s breach, such as when resolution of the counterclaim is necessary to determine the right of possession.
</p>
</div>
</div>

<div id="outline-container-org44eb104" class="outline-4">
<h4 id="org44eb104">[8] Landlord and Tenant  <a href="#org1314230">233-k-1789</a>  Set-off and counterclaim</h4>
<div class="outline-text-4" id="text-org44eb104">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-VIII Reentry and Recovery of Possession by Landlord</i></li>
<li><i>233-VIII(D) Actions for Unlawful Detainer</i></li>
<li><b>233-k-1783 Right of Action and Defenses</b></li>
<li><b>233-k-1789 Set-off and counterclaim</b></li>
</ul>

<p>
Tenants were entitled to raise counterclaim for relocation assistance in landlord’s unlawful detainer action; issue of right to possession was intimately tied to lawful status of the unit and tenants’ right to relocation assistance, relocation assistance claim was based on facts that would excuse tenants’ breach because it required finding that the dwelling was or would be unlawful to occupy, and excluding relocation assistance claim from unlawful detainer proceedings would undermine the goals of the relocation assistance statute. West’s RCWA 59.18.085.
</p>

<ul class="org-ul">
<li>2 Cases that cite this headnote</li>
</ul>
</div>
</div>

<div id="outline-container-org9ba3aca" class="outline-4">
<h4 id="org9ba3aca">[9] Landlord and Tenant  <a href="#orgeb7a601">233-k-1781</a>  Nature and form</h4>
<div class="outline-text-4" id="text-org9ba3aca">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-VIII Reentry and Recovery of Possession by Landlord</i></li>
<li><i>233-VIII(D) Actions for Unlawful Detainer</i></li>
<li><b>233-k-1781 Nature and form</b></li>
</ul>

<p>
An unlawful detainer action is a limited statutory proceeding to resolve the right to possession between the landlord and the tenant. West’s RCWA 59.12.010 et seq.
</p>
</div>
</div>

<div id="outline-container-org7a16c97" class="outline-4">
<h4 id="org7a16c97">[10] Forcible Entry and Detainer  <a href="#orgefd040f">179-k-6(2)</a>  Trial of title and right of possession</h4>
<div class="outline-text-4" id="text-org7a16c97">
<ul class="org-ul">
<li><i>179 Forcible Entry and Detainer</i></li>
<li><i>179-I Civil Liability</i></li>
<li><b>179-k-6 Nature and Form of Remedy</b></li>
<li><b>179-k-6(2) Trial of title and right of possession</b></li>
</ul>

<p>
In unlawful detainer actions, the law draws a distinction between possession and the right of possession.
</p>
</div>
</div>

<div id="outline-container-org4e808e5" class="outline-4">
<h4 id="org4e808e5">[11] Forcible Entry and Detainer  <a href="#orgfc26b7a">179-k-32</a>  Scope of inquiry and powers of court</h4>
<div class="outline-text-4" id="text-org4e808e5">
<ul class="org-ul">
<li><i>179 Forcible Entry and Detainer</i></li>
<li><i>179-I Civil Liability</i></li>
<li><b>179-k-31 Trial</b></li>
<li><b>179-k-32 Scope of inquiry and powers of court</b></li>
</ul>

<p>
Once an unlawful detainer action is commenced and the defendant does not concede the right to possession, he or she has the right to have the issue determined.
</p>
</div>
</div>

<div id="outline-container-org5001f8f" class="outline-4">
<h4 id="org5001f8f">[12] Action  <a href="#org1e0a3e1">13-k-36</a>  Change of character or form</h4>
<div class="outline-text-4" id="text-org5001f8f">
<ul class="org-ul">
<li><i>13 Action</i></li>
<li><i>13-II Nature and Form</i></li>
<li><b>13-k-36 Change of character or form</b></li>
</ul>

<p>
Where the right to possession ceases to be at issue at any time between the commencement of an unlawful detainer action and trial of that action, the proceeding may be converted into an ordinary civil suit for damages.
</p>
</div>
</div>

<div id="outline-container-orga1575bb" class="outline-4">
<h4 id="orga1575bb">[13] Action  <a href="#org113f14f">13-k-36</a>  Change of character or form</h4>
<div class="outline-text-4" id="text-orga1575bb">
<ul class="org-ul">
<li><i>13 Action</i></li>
<li><i>13-II Nature and Form</i></li>
<li><b>13-k-36 Change of character or form</b></li>
</ul>

<p>
A trial court has inherent power to fashion the method by which an unlawful detainer action is converted to an ordinary civil action one possession ceases to be at issue.
</p>
</div>
</div>

<div id="outline-container-orgaea7de1" class="outline-4">
<h4 id="orgaea7de1">[14] Action  <a href="#org4f08496">13-k-36</a>  Change of character or form</h4>
<div class="outline-text-4" id="text-orgaea7de1">
<ul class="org-ul">
<li><i>13 Action</i></li>
<li><i>13-II Nature and Form</i></li>
<li><b>13-k-36 Change of character or form</b></li>
</ul>

<p>
Once possession ceases to be at issue, and an unlawful detainer case has been converted to a civil action for damages, the trial court’s general jurisdiction is restored and it can hear claims between the parties that were excluded from the unlawful detainer action.
</p>
</div>
</div>

<div id="outline-container-org4731d46" class="outline-4">
<h4 id="org4731d46">[15] Landlord and Tenant  <a href="#org98c4ed3">233-k-1789</a>  Set-off and counterclaim</h4>
<div class="outline-text-4" id="text-org4731d46">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-VIII Reentry and Recovery of Possession by Landlord</i></li>
<li><i>233-VIII(D) Actions for Unlawful Detainer</i></li>
<li><b>233-k-1783 Right of Action and Defenses</b></li>
<li><b>233-k-1789 Set-off and counterclaim</b></li>
</ul>

<p>
An unlawful detainer action is an appropriate forum for relocation assistance claims. West’s RCWA 59.18.085.
</p>
</div>
</div>

<div id="outline-container-orgcc144ba" class="outline-4">
<h4 id="orgcc144ba">[16] Landlord and Tenant  <a href="#orgdee050a">233-k-1054(3)</a>  Evidence</h4>
<div class="outline-text-4" id="text-orgcc144ba">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-V Enjoyment and Use of Premises</i></li>
<li><i>233-V(B) Description, Extent, and Condition</i></li>
<li><b>233-k-1049 Tenantable Condition of Premises</b></li>
<li><b>233-k-1054 Actions</b></li>
<li><b>233-k-1054(3) Evidence</b></li>
</ul>

<p>
Evidence was sufficient to establish that conditions in rental unit presented substantial risk of future danger, so as to support finding that landlord breached implied warranty of habitability; evidence was presented that city housing and zoning inspector determined that there was sewage leak that needed to be rectified quickly, that landlord had been informed about sewage leak and that lines needed to be replaced, that there were rodents present, that stairs, handrails, back door, door to crawl space, and bathroom sink were in poor condition, and that there were dangerous electrical violations.
</p>
</div>
</div>
