20150526T000000==coa=div1--pham-v-corbett-187-wn-app-816-351-p3d-214-2015__breach_case_habitability_warranty.org
*** [17] Landlord and Tenant  [[17: 233-k-1787][233-k-1787]]  Defenses and grounds of opposition in general

- /233 Landlord and Tenant/
- /233-VIII Reentry and Recovery of Possession by Landlord/
- /233-VIII(D) Actions for Unlawful Detainer/
- *233-k-1783 Right of Action and Defenses*
- *233-k-1787 Defenses and grounds of opposition in general*

In a residential unlawful detainer action, a tenant may raise a defense based on a landlord’s breach of the implied warranty of habitability.

*** [18] Landlord and Tenant  [[18: 233-k-1439][233-k-1439]]  Condition of Premises

- /233 Landlord and Tenant/
- /233-VII Rent/
- /233-VII(A) Rights and Liabilities/
- /233-VII(A)2 Particular Grounds of Discharge from Liability/
- *233-k-1439 Condition of Premises*
- *233-k-1440 In general*

For a breach of implied warranty of habitability, the trier of fact must find: (1) whether the evidence indicates that the premises were totally or partially uninhabitable during the period of habitation and, if so, (2) what portion, if any or all, of the defendant’s obligation to pay rent is relieved by the landlord’s total or partial breach of his implied warranty of habitability.

*** [19] Landlord and Tenant  [[19: 233-k-1054(4)][233-k-1054(4)]]  Trial

- /233 Landlord and Tenant/
- /233-V Enjoyment and Use of Premises/
- /233-V(B) Description, Extent, and Condition/
- *233-k-1049 Tenantable Condition of Premises*
- *233-k-1054 Actions*
- *233-k-1054(4) Trial*

Applicability of the implied warranty of habitability is a mixed question of law and fact.

*** [20] Landlord and Tenant  [[20: 233-k-1052][233-k-1052]]  Warranty of habitability

- /233 Landlord and Tenant/
- /233-V Enjoyment and Use of Premises/
- /233-V(B) Description, Extent, and Condition/
- *233-k-1049 Tenantable Condition of Premises*
- *233-k-1052 Warranty of habitability*

Conditions that present a substantial risk of future danger will give rise to a claim for breach of implied warranty of habitability.

*** [21] Appeal and Error  [[21: 30-k-3415][30-k-3415]]  Substitution of Reviewing Court’s Discretion or Judgment

- /30 Appeal and Error/
- /30-XVI Review/
- /30-XVI(D) Scope and Extent of Review/
- /30-XVI(D)9 Verdict and Findings in General/
- *30-k-3415 Substitution of Reviewing Court’s Discretion or Judgment*
- *30-k-3416 In general*
- /(Formerly 30k1008.1(3))/

As long as substantial evidence supports the trial court’s findings of fact, a reviewing court will not substitute its judgment for that of the trial court even though it may have resolved a factual dispute differently.

- 2 Cases that cite this headnote

*** [22] Landlord and Tenant  [[22: 233-k-1054][233-k-1054]]  Actions

- /233 Landlord and Tenant/
- /233-V Enjoyment and Use of Premises/
- /233-V(B) Description, Extent, and Condition/
- *233-k-1049 Tenantable Condition of Premises*
- *233-k-1054 Actions*
- *233-k-1054(1) In general*

Evidence supported finding that tenants provided landlord with required statutory notice and opportunity to cure defects in rental unit, in unlawful detainer action in which tenant’s claimed that landlord breached implied warranty of habitability; evidence was presented that, in addition to complaints from tenants, landlord received at least three letters from city housing and zoning inspector advising him of defects, and landlord presented no evidence that defects were ever cured. West’s RCWA 59.18.070.

*** [23] Motions  [[23: 267-k-62][267-k-62]]  Construction and operation of orders in general

- /267 Motions/
- *267-k-62 Construction and operation of orders in general*

A written order controls over any apparent inconsistency with the court’s earlier oral ruling.

- 9 Cases that cite this headnote

*** [24] Health  [[24: 198H-k-392][198H-k-392]]  Buildings, structures, and building components

- /198 HHealth/
- /198H-II Public Health/
- *198H-k-390 Unsafe or Unhealthful Premises*
- *198H-k-392 Buildings, structures, and building components*

Tenants were entitled to relocation assistance from landlord, even though city never issued a notice of condemnation, eviction, or displacement order, where landlord received three letters from city housing and zoning inspector informing him that the dwelling was unlawful to occupy because it was permitted for use as a triplex and not five-plex, and that its condition was substandard and violated multiple provisions of the housing code. West’s RCWA 59.18.085(3)(a).

*** [25] Health  [[25: 198H-k-392][198H-k-392]]  Buildings, structures, and building components

- /198 HHealth/
- /198H-II Public Health/
- *198H-k-390 Unsafe or Unhealthful Premises*
- *198H-k-392 Buildings, structures, and building components*

A landlord is required to pay relocation assistance if a government agency notifies the landlord that the building will be condemned or deemed unlawful to occupy; in that circumstance, it is irrelevant whether the landlord has received notice of an order of condemnation, eviction, or displacement. West’s RCWA 59.18.085(3)(a).

*** [26] Health  [[26: 198H-k-392][198H-k-392]]  Buildings, structures, and building components

- /198 HHealth/
- /198H-II Public Health/
- *198H-k-390 Unsafe or Unhealthful Premises*
- *198H-k-392 Buildings, structures, and building components*

There is no safe harbor for landlords under statute requiring relocation assistance payments to tenants once the landlords have been notified that the dwelling will be condemned or will be unlawful to occupy, even if the landlords are in the process of permitting. West’s RCWA 59.18.085(3)(a).

*** [27] Health  [[27: 198H-k-392][198H-k-392]]  Buildings, structures, and building components

- /198 HHealth/
- /198H-II Public Health/
- *198H-k-390 Unsafe or Unhealthful Premises*
- *198H-k-392 Buildings, structures, and building components*

Relocation assistance statute requires that a landlord be notified that a building is unlawful to occupy and to have actual or constructive knowledge of the conditions giving rise to the illegal status before requiring them to pay relocation assistance. West’s RCWA 59.18.085(3)(a).

