osb/html/20150526T000000==coa=div1--pham-v-corbett-187-wn-app-816-351-p3d-214-2015__breach_case_habitability_warranty.html

<div id="outline-container-orgc4973a7" class="outline-4">
<h4 id="orgc4973a7">[17] Landlord and Tenant  <a href="#org74f0405">233-k-1787</a>  Defenses and grounds of opposition in general</h4>
<div class="outline-text-4" id="text-orgc4973a7">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-VIII Reentry and Recovery of Possession by Landlord</i></li>
<li><i>233-VIII(D) Actions for Unlawful Detainer</i></li>
<li><b>233-k-1783 Right of Action and Defenses</b></li>
<li><b>233-k-1787 Defenses and grounds of opposition in general</b></li>
</ul>

<p>
In a residential unlawful detainer action, a tenant may raise a defense based on a landlord’s breach of the implied warranty of habitability.
</p>
</div>
</div>

<div id="outline-container-orgc4bc735" class="outline-4">
<h4 id="orgc4bc735">[18] Landlord and Tenant  <a href="#orgaace92d">233-k-1439</a>  Condition of Premises</h4>
<div class="outline-text-4" id="text-orgc4bc735">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-VII Rent</i></li>
<li><i>233-VII(A) Rights and Liabilities</i></li>
<li><i>233-VII(A)2 Particular Grounds of Discharge from Liability</i></li>
<li><b>233-k-1439 Condition of Premises</b></li>
<li><b>233-k-1440 In general</b></li>
</ul>

<p>
For a breach of implied warranty of habitability, the trier of fact must find: (1) whether the evidence indicates that the premises were totally or partially uninhabitable during the period of habitation and, if so, (2) what portion, if any or all, of the defendant’s obligation to pay rent is relieved by the landlord’s total or partial breach of his implied warranty of habitability.
</p>
</div>
</div>

<div id="outline-container-org9de9a51" class="outline-4">
<h4 id="org9de9a51">[19] Landlord and Tenant  <a href="#org29c4ec6">233-k-1054(4)</a>  Trial</h4>
<div class="outline-text-4" id="text-org9de9a51">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-V Enjoyment and Use of Premises</i></li>
<li><i>233-V(B) Description, Extent, and Condition</i></li>
<li><b>233-k-1049 Tenantable Condition of Premises</b></li>
<li><b>233-k-1054 Actions</b></li>
<li><b>233-k-1054(4) Trial</b></li>
</ul>

<p>
Applicability of the implied warranty of habitability is a mixed question of law and fact.
</p>
</div>
</div>

<div id="outline-container-org120ca70" class="outline-4">
<h4 id="org120ca70">[20] Landlord and Tenant  <a href="#org158b16f">233-k-1052</a>  Warranty of habitability</h4>
<div class="outline-text-4" id="text-org120ca70">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-V Enjoyment and Use of Premises</i></li>
<li><i>233-V(B) Description, Extent, and Condition</i></li>
<li><b>233-k-1049 Tenantable Condition of Premises</b></li>
<li><b>233-k-1052 Warranty of habitability</b></li>
</ul>

<p>
Conditions that present a substantial risk of future danger will give rise to a claim for breach of implied warranty of habitability.
</p>
</div>
</div>

<div id="outline-container-orgcc8e304" class="outline-4">
<h4 id="orgcc8e304">[21] Appeal and Error  <a href="#org575a354">30-k-3415</a>  Substitution of Reviewing Court’s Discretion or Judgment</h4>
<div class="outline-text-4" id="text-orgcc8e304">
<ul class="org-ul">
<li><i>30 Appeal and Error</i></li>
<li><i>30-XVI Review</i></li>
<li><i>30-XVI(D) Scope and Extent of Review</i></li>
<li><i>30-XVI(D)9 Verdict and Findings in General</i></li>
<li><b>30-k-3415 Substitution of Reviewing Court’s Discretion or Judgment</b></li>
<li><b>30-k-3416 In general</b></li>
<li><i>(Formerly 30k1008.1(3))</i></li>
</ul>

<p>
As long as substantial evidence supports the trial court’s findings of fact, a reviewing court will not substitute its judgment for that of the trial court even though it may have resolved a factual dispute differently.
</p>

<ul class="org-ul">
<li>2 Cases that cite this headnote</li>
</ul>
</div>
</div>

<div id="outline-container-org177876c" class="outline-4">
<h4 id="org177876c">[22] Landlord and Tenant  <a href="#org33f1391">233-k-1054</a>  Actions</h4>
<div class="outline-text-4" id="text-org177876c">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-V Enjoyment and Use of Premises</i></li>
<li><i>233-V(B) Description, Extent, and Condition</i></li>
<li><b>233-k-1049 Tenantable Condition of Premises</b></li>
<li><b>233-k-1054 Actions</b></li>
<li><b>233-k-1054(1) In general</b></li>
</ul>

<p>
Evidence supported finding that tenants provided landlord with required statutory notice and opportunity to cure defects in rental unit, in unlawful detainer action in which tenant’s claimed that landlord breached implied warranty of habitability; evidence was presented that, in addition to complaints from tenants, landlord received at least three letters from city housing and zoning inspector advising him of defects, and landlord presented no evidence that defects were ever cured. West’s RCWA 59.18.070.
</p>
</div>
</div>

<div id="outline-container-orgfc47bbd" class="outline-4">
<h4 id="orgfc47bbd">[23] Motions  <a href="#org4900dbc">267-k-62</a>  Construction and operation of orders in general</h4>
<div class="outline-text-4" id="text-orgfc47bbd">
<ul class="org-ul">
<li><i>267 Motions</i></li>
<li><b>267-k-62 Construction and operation of orders in general</b></li>
</ul>

<p>
A written order controls over any apparent inconsistency with the court’s earlier oral ruling.
</p>

<ul class="org-ul">
<li>9 Cases that cite this headnote</li>
</ul>
</div>
</div>

<div id="outline-container-orgfb6b8e3" class="outline-4">
<h4 id="orgfb6b8e3">[24] Health  <a href="#org0932d6a">198H-k-392</a>  Buildings, structures, and building components</h4>
<div class="outline-text-4" id="text-orgfb6b8e3">
<ul class="org-ul">
<li><i>198 HHealth</i></li>
<li><i>198H-II Public Health</i></li>
<li><b>198H-k-390 Unsafe or Unhealthful Premises</b></li>
<li><b>198H-k-392 Buildings, structures, and building components</b></li>
</ul>

<p>
Tenants were entitled to relocation assistance from landlord, even though city never issued a notice of condemnation, eviction, or displacement order, where landlord received three letters from city housing and zoning inspector informing him that the dwelling was unlawful to occupy because it was permitted for use as a triplex and not five-plex, and that its condition was substandard and violated multiple provisions of the housing code. West’s RCWA 59.18.085(3)(a).
</p>
</div>
</div>

<div id="outline-container-org1e392d5" class="outline-4">
<h4 id="org1e392d5">[25] Health  <a href="#orga8f3e6d">198H-k-392</a>  Buildings, structures, and building components</h4>
<div class="outline-text-4" id="text-org1e392d5">
<ul class="org-ul">
<li><i>198 HHealth</i></li>
<li><i>198H-II Public Health</i></li>
<li><b>198H-k-390 Unsafe or Unhealthful Premises</b></li>
<li><b>198H-k-392 Buildings, structures, and building components</b></li>
</ul>

<p>
A landlord is required to pay relocation assistance if a government agency notifies the landlord that the building will be condemned or deemed unlawful to occupy; in that circumstance, it is irrelevant whether the landlord has received notice of an order of condemnation, eviction, or displacement. West’s RCWA 59.18.085(3)(a).
</p>
</div>
</div>

<div id="outline-container-orgd36396f" class="outline-4">
<h4 id="orgd36396f">[26] Health  <a href="#org45e08b1">198H-k-392</a>  Buildings, structures, and building components</h4>
<div class="outline-text-4" id="text-orgd36396f">
<ul class="org-ul">
<li><i>198 HHealth</i></li>
<li><i>198H-II Public Health</i></li>
<li><b>198H-k-390 Unsafe or Unhealthful Premises</b></li>
<li><b>198H-k-392 Buildings, structures, and building components</b></li>
</ul>

<p>
There is no safe harbor for landlords under statute requiring relocation assistance payments to tenants once the landlords have been notified that the dwelling will be condemned or will be unlawful to occupy, even if the landlords are in the process of permitting. West’s RCWA 59.18.085(3)(a).
</p>
</div>
</div>

<div id="outline-container-orgfb6069a" class="outline-4">
<h4 id="orgfb6069a">[27] Health  <a href="#orge8b10d4">198H-k-392</a>  Buildings, structures, and building components</h4>
<div class="outline-text-4" id="text-orgfb6069a">
<ul class="org-ul">
<li><i>198 HHealth</i></li>
<li><i>198H-II Public Health</i></li>
<li><b>198H-k-390 Unsafe or Unhealthful Premises</b></li>
<li><b>198H-k-392 Buildings, structures, and building components</b></li>
</ul>

<p>
Relocation assistance statute requires that a landlord be notified that a building is unlawful to occupy and to have actual or constructive knowledge of the conditions giving rise to the illegal status before requiring them to pay relocation assistance. West’s RCWA 59.18.085(3)(a).
</p>
</div>
</div>
