20150526T000000==coa=div1--pham-v-corbett-187-wn-app-816-351-p3d-214-2015__breach_case_habitability_warranty.org
*** [28] Health  [[28: 198H-k-392][198H-k-392]]  Buildings, structures, and building components
Landlord and TenantStatutory regulations in general

- /198 HHealth/
- /198H-II Public Health/
- *198H-k-390 Unsafe or Unhealthful Premises*
- *198H-k-392 Buildings, structures, and building components*
- /233 Landlord and Tenant/
- /233-V Enjoyment and Use of Premises/
- /233-V(B) Description, Extent, and Condition/
- *233-k-1049 Tenantable Condition of Premises*
- *233-k-1051 Statutory regulations in general*

Seattle municipal code imposes its own requirements for payment of relocation assistance upon the issuance of an emergency order to vacate a rental unit; the city’s procedures do not, however, affect the tenants’ rights or a landlord’s obligations under the Residential Landlord Tenant Act. West’s RCWA 59.18.085.

*** [29] Landlord and Tenant  [[29: 233-k-1051][233-k-1051]]  Statutory regulations in general

- /233 Landlord and Tenant/
- /233-V Enjoyment and Use of Premises/
- /233-V(B) Description, Extent, and Condition/
- *233-k-1049 Tenantable Condition of Premises*
- *233-k-1051 Statutory regulations in general*

A tenant is entitled to bring a private action against a landlord to recover relocation assistance when a rental unit is unlawful to occupy, independent of governmental enforcement. West’s RCWA 59.18.085(3)(c, e).

*** [30] Landlord and Tenant  [[30: 233-k-1540][233-k-1540]]  Claims which may be subject of set-off, counterclaim, or recoupment in general

- /233 Landlord and Tenant/
- /233-VII Rent/
- /233-VII(B) Actions/
- *233-k-1538 Set-off and Counterclaim*
- *233-k-1540 Claims which may be subject of set-off, counterclaim, or recoupment in general*

Tenants were entitled to apply last month’s rent that they had pre-paid to landlord as an offset against unpaid rent due and owing, to bring them out of default in landlord’s unlawful detainer action, where tenants raised defense that they were current in rent because they had pre-paid the last month’s rent. West’s RCWA 59.18.400.

*** [31] Landlord and Tenant  [[31: 233-k-1806][233-k-1806]]  Damages and amount of recovery

- /233 Landlord and Tenant/
- /233-VIII Reentry and Recovery of Possession by Landlord/
- /233-VIII(D) Actions for Unlawful Detainer/
- *233-k-1790 Actions*
- *233-k-1806 Damages and amount of recovery*

Evidence supported finding that rental unit’s habitability had been reduced by 25% as a result of sewer leak, rodent problem, structural defects, and overall very poor overall quality of unit’s installation, so as to support diminution of unit’s rental value in landlord’s unlawful detainer action against tenants.

*** [32] Landlord and Tenant  [[32: 233-k-1597][233-k-1597]]  Damages

- /233 Landlord and Tenant/
- /233-VII Rent/
- /233-VII(B) Actions/
- *233-k-1597 Damages*

Landlord was not entitled to charge tenants late fees for months that tenants held over and failed to pay rent; although lease terms allowing for late fees for unpaid rent applied to holdover tenancy, tenants were current in rent based on diminution in value of premises due to landlord’s breach of warranty of habitability.

- 1 Case that cites this headnote

*** [33] Landlord and Tenant  [[33: 233-k-851][233-k-851]]  Conditions in general

- /233 Landlord and Tenant/
- /233-IV Particular Kinds of Tenancies and Attributes Thereof/
- /233-IV(D) Extensions and Renewals/
- *233-k-849 Holding Over, Extension or Renewal by*
- *233-k-851 Conditions in general*

General rule is that the terms of a fixed lease apply to the terms of a holdover tenancy, even in the absence of language in a holdover provision.

*** [34] Appeal and Error  [[34: 30-k-4072][30-k-4072]]  Verdict, Findings, Sufficiency of Evidence, and Judgment

- /30 Appeal and Error/
- /30-XVI Review/
- /30-XVI(H) Theory and Grounds of Decision Below and on Review/
- *30-k-4065 Particular Orders or Rulings Below, Theory and Grounds Supporting*
- *30-k-4072 Verdict, Findings, Sufficiency of Evidence, and Judgment*
- *30-k-4072(1) In general*
- /(Formerly 30k852)/

An appellate court may sustain a trial court’s judgment upon any theory established by the pleadings and supported by proof.

** Attorneys and Law Firms

- {{**217}} Evan Lee Loeffler, Christopher Daniel Cutting, Jeana Kay Poloni, Loeffler Law Group PLLC, Seattle, WA, for Appellant.

- Elisabeth Pualani Lindsley, Attorney at Law, Gary Manca, Manca Law, PLLC, Seattle, WA, for Respondent.

- Steven R. Rovig, Hillis Clark Martin & Peterson, Jacob Michael Wicks, Attorney at Law, Seattle, WA, for Amicus Curiae on behalf of King County Bar Association.

