osb/html/20150526T000000==coa=div1--pham-v-corbett-187-wn-app-816-351-p3d-214-2015__breach_case_habitability_warranty.html

<div id="outline-container-org732230a" class="outline-4">
<h4 id="org732230a">[28] Health  <a href="#org75ce576">198H-k-392</a>  Buildings, structures, and building components</h4>
<div class="outline-text-4" id="text-org732230a">
<p>
Landlord and TenantStatutory regulations in general
</p>

<ul class="org-ul">
<li><i>198 HHealth</i></li>
<li><i>198H-II Public Health</i></li>
<li><b>198H-k-390 Unsafe or Unhealthful Premises</b></li>
<li><b>198H-k-392 Buildings, structures, and building components</b></li>
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-V Enjoyment and Use of Premises</i></li>
<li><i>233-V(B) Description, Extent, and Condition</i></li>
<li><b>233-k-1049 Tenantable Condition of Premises</b></li>
<li><b>233-k-1051 Statutory regulations in general</b></li>
</ul>

<p>
Seattle municipal code imposes its own requirements for payment of relocation assistance upon the issuance of an emergency order to vacate a rental unit; the city’s procedures do not, however, affect the tenants’ rights or a landlord’s obligations under the Residential Landlord Tenant Act. West’s RCWA 59.18.085.
</p>
</div>
</div>

<div id="outline-container-org526e05a" class="outline-4">
<h4 id="org526e05a">[29] Landlord and Tenant  <a href="#org1281236">233-k-1051</a>  Statutory regulations in general</h4>
<div class="outline-text-4" id="text-org526e05a">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-V Enjoyment and Use of Premises</i></li>
<li><i>233-V(B) Description, Extent, and Condition</i></li>
<li><b>233-k-1049 Tenantable Condition of Premises</b></li>
<li><b>233-k-1051 Statutory regulations in general</b></li>
</ul>

<p>
A tenant is entitled to bring a private action against a landlord to recover relocation assistance when a rental unit is unlawful to occupy, independent of governmental enforcement. West’s RCWA 59.18.085(3)(c, e).
</p>
</div>
</div>

<div id="outline-container-org93f6917" class="outline-4">
<h4 id="org93f6917">[30] Landlord and Tenant  <a href="#orgbbaf6ef">233-k-1540</a>  Claims which may be subject of set-off, counterclaim, or recoupment in general</h4>
<div class="outline-text-4" id="text-org93f6917">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-VII Rent</i></li>
<li><i>233-VII(B) Actions</i></li>
<li><b>233-k-1538 Set-off and Counterclaim</b></li>
<li><b>233-k-1540 Claims which may be subject of set-off, counterclaim, or recoupment in general</b></li>
</ul>

<p>
Tenants were entitled to apply last month’s rent that they had pre-paid to landlord as an offset against unpaid rent due and owing, to bring them out of default in landlord’s unlawful detainer action, where tenants raised defense that they were current in rent because they had pre-paid the last month’s rent. West’s RCWA 59.18.400.
</p>
</div>
</div>

<div id="outline-container-org21792e0" class="outline-4">
<h4 id="org21792e0">[31] Landlord and Tenant  <a href="#orgb373850">233-k-1806</a>  Damages and amount of recovery</h4>
<div class="outline-text-4" id="text-org21792e0">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-VIII Reentry and Recovery of Possession by Landlord</i></li>
<li><i>233-VIII(D) Actions for Unlawful Detainer</i></li>
<li><b>233-k-1790 Actions</b></li>
<li><b>233-k-1806 Damages and amount of recovery</b></li>
</ul>

<p>
Evidence supported finding that rental unit’s habitability had been reduced by 25% as a result of sewer leak, rodent problem, structural defects, and overall very poor overall quality of unit’s installation, so as to support diminution of unit’s rental value in landlord’s unlawful detainer action against tenants.
</p>
</div>
</div>

<div id="outline-container-orge68de75" class="outline-4">
<h4 id="orge68de75">[32] Landlord and Tenant  <a href="#orgf04f6cd">233-k-1597</a>  Damages</h4>
<div class="outline-text-4" id="text-orge68de75">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-VII Rent</i></li>
<li><i>233-VII(B) Actions</i></li>
<li><b>233-k-1597 Damages</b></li>
</ul>

<p>
Landlord was not entitled to charge tenants late fees for months that tenants held over and failed to pay rent; although lease terms allowing for late fees for unpaid rent applied to holdover tenancy, tenants were current in rent based on diminution in value of premises due to landlord’s breach of warranty of habitability.
</p>

<ul class="org-ul">
<li>1 Case that cites this headnote</li>
</ul>
</div>
</div>

<div id="outline-container-org30c0e29" class="outline-4">
<h4 id="org30c0e29">[33] Landlord and Tenant  <a href="#orga61fcc0">233-k-851</a>  Conditions in general</h4>
<div class="outline-text-4" id="text-org30c0e29">
<ul class="org-ul">
<li><i>233 Landlord and Tenant</i></li>
<li><i>233-IV Particular Kinds of Tenancies and Attributes Thereof</i></li>
<li><i>233-IV(D) Extensions and Renewals</i></li>
<li><b>233-k-849 Holding Over, Extension or Renewal by</b></li>
<li><b>233-k-851 Conditions in general</b></li>
</ul>

<p>
General rule is that the terms of a fixed lease apply to the terms of a holdover tenancy, even in the absence of language in a holdover provision.
</p>
</div>
</div>

<div id="outline-container-orgc999d9c" class="outline-4">
<h4 id="orgc999d9c">[34] Appeal and Error  <a href="#org0239e50">30-k-4072</a>  Verdict, Findings, Sufficiency of Evidence, and Judgment</h4>
<div class="outline-text-4" id="text-orgc999d9c">
<ul class="org-ul">
<li><i>30 Appeal and Error</i></li>
<li><i>30-XVI Review</i></li>
<li><i>30-XVI(H) Theory and Grounds of Decision Below and on Review</i></li>
<li><b>30-k-4065 Particular Orders or Rulings Below, Theory and Grounds Supporting</b></li>
<li><b>30-k-4072 Verdict, Findings, Sufficiency of Evidence, and Judgment</b></li>
<li><b>30-k-4072(1) In general</b></li>
<li><i>(Formerly 30k852)</i></li>
</ul>

<p>
An appellate court may sustain a trial court’s judgment upon any theory established by the pleadings and supported by proof.
</p>
</div>
</div>
</div>

<div id="outline-container-org8df5fa0" class="outline-3">
<h3 id="org8df5fa0">Attorneys and Law Firms</h3>
<div class="outline-text-3" id="text-org8df5fa0">
<ul class="org-ul">
<li>{{**217}} Evan Lee Loeffler, Christopher Daniel Cutting, Jeana Kay Poloni, Loeffler Law Group PLLC, Seattle, WA, for Appellant.</li>

<li>Elisabeth Pualani Lindsley, Attorney at Law, Gary Manca, Manca Law, PLLC, Seattle, WA, for Respondent.</li>

<li>Steven R. Rovig, Hillis Clark Martin &amp; Peterson, Jacob Michael Wicks, Attorney at Law, Seattle, WA, for Amicus Curiae on behalf of King County Bar Association.</li>
</ul>
</div>
</div>
